<?php

Route::get("/room/{id}", function ($id) {
    $rooms =[
        "1" => [
            "title" => "Комната",
            "description" => "Комната. Твоя. Воняет. Зато твоя.",
            "actions" => [
                "Продолжить лежать на кроватке." => "1-1",
                "Покушать." => "1-2"
            ]
        ],
        "1-2" => [
            "title" => "Кухня",
            "description" => "Ты поднялся с кроватки и пошел на кухню. Открыл холодильник. Он оказался пустым",
            "actions" => [
                "Пойтив магазин." => "2",
                "Вернуться обратно в комнату." => "1-1"
            ]
        ],
        "1-1" => [
            "title" => "Комната",
            "description" => "Комната. Твоя. Воняет. Зато твоя.",
            "actions" => [
                "Продолжить лежать на кроватке." => "1-1-1",
                "Собраться с мыслями и пойти в магазин." => "2"
            ]
        ],
        "1-1-1" => [
            "title" => "Комната",
            "description" => "Комната. Твоя. Воняет. Зато твоя.",
            "actions" => [
                "Продолжить лежать на кроватке." => "1-1-2",
                "Собраться с мыслями и пойти в магазин." => "2"
            ]
        ],
        "1-1-2" => [
            "title" => "Комната",
            "description" => "Ты умер от голода."
        ]
    ];
    $room = $rooms[$id];
   return view("quest", ["room" => $room]);
})->name("room");

Route::get("/", function () {
    return redirect()->route("room", ["id" => 1]);
});